<!doctype html>

<head>
    <title>Опрос</title>
    <meta charset="UTF-8">
    <style>
        body {
            margin: 0;
            padding: 0;
            text-align: center;
        }

        #poll_container {
            display: inline-block;
            width: 60%;
        }

        .point {
            list-style: none;
            display: inline-block;
        }

        .question {
            list-style: none;
        }

        ul li {
            margin-left: 10px;
        }

        .question li {
            text-align: left;
        }

        #error {
            color: red;
            font-size: 24pt;
        }

        ol {
            list-style: none;
        }
    </style>
</head>



<body>
    <?php
        $method = $_SERVER["REQUEST_METHOD"];
        $error = "";
        if ($method == "POST") {
            $number_of_answers = sizeof($_POST);
            if ($number_of_answers != 17) {
                $error = "<div id='error'>Пожалуйста, ответьте на все пункты опроса.</div>";
            } else {
                //TODO: Внесение в базу данных, запись куков, редирект
            }
        }

        echo $error;
    ?>
    <div id="poll_container">
        <form id="poll" action="poll.php" method="post">
            <h1>Опрос</h1>
            <ol>
                <li class="section" id="section-1">
                    <hr>
                    <h2>Открытость и доступность информации, размещенной на официальном сайте.</h2>
                    <ol class="question">
                        <li>
                            <ul class="point">
                                <li>
                                    <h3>Полнота и актуальность информации об организации и ее деятельности.</h3>
                                    <input type="radio" id="1.1.1" name="question-1.1" value="1">
                                    <label for="1.1.1">неудовлетворительно, не устраивает (информация
                                        отсутствует);</label>
                                    <br>
                                    <input type="radio" id="1.1.2" name="question-1.1" value="2">
                                    <label for="1.1.2">плохо, не соответствует минимальным требованиям (информация
                                        представлена не полностью, не структурирована, не актуальна);</label>
                                    <br>
                                    <input type="radio" id="1.1.3" name="question-1.1" value="3">
                                    <label for="1.1.3">удовлетворительно, но со значительными недостатками (информация
                                        представлена полностью, плохо структурирована, не актуальна);
                                    </label>
                                    <br>
                                    <input type="radio" id="1.1.4" name="question-1.1" value="4">
                                    <label for="1.1.4">в целом хорошо, за исключением незначительных недостатков
                                        (информация представлена полностью, хорошо структурирована, частично не
                                        актуальна);
                                    </label>
                                    <br>
                                    <input type="radio" id="1.1.5" name="question-1.1" value="5">
                                    <label for="1.1.5">отлично, полностью удовлетворен(а) (информация размещена
                                        полностью, хорошо структурирована, актуальна);
                                    </label>
                                </li>
                            </ul>
                        </li>
                    </ol>
                    <hr>
                    <ol class="question">
                        <li>
                            <ul class="point">
                                <li>
                                    <h3>Наличие сведений о педагогических работниках организации.</h3>
                                    <input type="radio" id="1.2.1" name="question-1.2" value="1">
                                    <label for="1.2.1">неудовлетворительно, не устраивает (информация
                                        отсутствует);</label>
                                    <br>
                                    <input type="radio" id="1.2.2" name="question-1.2" value="2">
                                    <label for="1.2.2">плохо, не соответствует минимальным требованиям (информация
                                        представлена не полностью, не структурирована, не актуальна);</label>
                                    <br>
                                    <input type="radio" id="1.2.3" name="question-1.2" value="3">
                                    <label for="1.2.3">удовлетворительно, но со значительными недостатками (информация
                                        представлена полностью, плохо структурирована, не актуальна);
                                    </label>
                                    <br>
                                    <input type="radio" id="1.2.4" name="question-1.2" value="4">
                                    <label for="1.2.4">в целом хорошо, за исключением незначительных недостатков
                                        (информация представлена полностью, хорошо структурирована, частично не
                                        актуальна);
                                    </label>
                                    <br>
                                    <input type="radio" id="1.2.5" name="question-1.2" value="5">
                                    <label for="1.2.5">отлично, полностью удовлетворен(а) (информация размещена
                                        полностью, размещена актуальная информация);
                                    </label>
                                </li>
                            </ul>
                        </li>
                    </ol>
                    <hr>
                    <ol class="question">
                        <li>
                            <ul class="point">
                                <li>
                                    <h3>Доступность взаимодействия с получателями образовательных услуг по телефону, по
                                        электронной почте, с помощью электронных сервисов,
                                        в том числе наличие возможности внесения предложений, направленных на улучшение
                                        работы организации.</h3>
                                    <input type="radio" id="1.3.1" name="question-1.3" value="1">
                                    <label for="1.3.1">неудовлетворительно, не устраивает (взаимодействие с участниками
                                        образовательного процесса не обеспечено);
                                    </label>
                                    <br>
                                    <input type="radio" id="1.3.2" name="question-1.3" value="2">
                                    <label for="1.3.2">плохо, не соответствует минимальным требованиям (обеспечена
                                        работа
                                        телефона горячей линии по вопросам оказания образовательных услуг);
                                    </label>
                                    <br>
                                    <input type="radio" id="1.3.3" name="question-1.3" value="3">
                                    <label for="1.3.3">удовлетворительно, но со значительными недостатками (обеспечена
                                        работа телефона горячей линии, взаимодействие с участниками образовательного
                                        процесса обеспечено по электронной почте);
                                    </label>
                                    <br>
                                    <input type="radio" id="1.3.4" name="question-1.3" value="4">
                                    <label for="1.3.4">в целом хорошо, за исключением незначительных недостатков
                                        (обеспечена работа телефона горячей линии, налажено взаимодействие по
                                        электронной почте, на сайте организации функционирует гостевая книга);
                                    </label>
                                    <br>
                                    <input type="radio" id="1.3.5" name="question-1.3" value="5">
                                    <label for="1.3.5">отлично, полностью удовлетворен(а) (Обеспечена работа телефона
                                        горячей линии, налажено взаимодействие по электронной почте, на сайте
                                        организации функционирует гостевая книга, обеспечена техническая возможность
                                        проведения онлайн-опросов (анкетирование) с целью изучения мнений и получения
                                        предложений по разным направлениям деятельности образовательной организации).
                                    </label>
                                </li>
                            </ul>
                        </li>
                    </ol>
                    <hr>
                    <ol class="question">
                        <li>
                            <ul class="point">
                                <li>
                                    <h3>Доступность сведений о ходе рассмотрения обращений граждан, поступивших в
                                        организацию от
                                        получателей образовательных услуг (по телефону, по электронной почте, с помощью
                                        электронных сервисов).</h3>
                                    <input type="radio" id="1.4.1" name="question-1.4" value="1">
                                    <label for="1.4.1">неудовлетворительно, не устраивает (не обеспечена доступность
                                        сведений о ходе рассмотрения обращения граждан);
                                    </label>
                                    <br>
                                    <input type="radio" id="1.4.2" name="question-1.4" value="2">
                                    <label for="1.4.2">плохо, не соответствует минимальным требованиям (обеспечена
                                        работа
                                        телефона горячей линии по вопросам оказания образовательных услуг);
                                    </label>
                                    <br>
                                    <input type="radio" id="1.4.3" name="question-1.4" value="3">
                                    <label for="1.4.3">удовлетворительно, но со значительными недостатками (обеспечена
                                        работа телефона горячей линии, взаимодействие с участниками образовательного
                                        процесса обеспечено по электронной почте);
                                    </label>
                                    <br>
                                    <input type="radio" id="1.4.4" name="question-1.4" value="4">
                                    <label for="1.4.4">в целом хорошо, за исключением незначительных недостатков
                                        (обеспечена работа телефона горячей линии, налажено взаимодействие по
                                        электронной почте, на сайте организации функционирует гостевая книга);
                                    </label>
                                    <br>
                                    <input type="radio" id="1.4.5" name="question-1.4" value="5">
                                    <label for="1.4.5">отлично, полностью удовлетворен(а) (Обеспечена работа телефона
                                        горячей линии, налажено взаимодействие по электронной почте, на сайте
                                        организации функционирует гостевая книга, обеспечена техническая возможность
                                        проведения онлайн-опросов (анкетирование) с целью изучения мнений и получения
                                        предложений по разным направлениям деятельности образовательной организации).
                                    </label>
                                </li>
                            </ul>
                        </li>
                    </ol>
                    <hr>
                </li>


                <li class="section" id="section-2">
                    <h2>Комфортность условий, в которых осуществляется образовательная деятельность.</h2>
                    <ol class="question">
                        <li>
                            <ul class="point">
                                <li>
                                    <h3>Материально-техническое и информационное обеспечение организации.</h3>
                                    <input type="radio" id="2.1.1" name="question-2.1" value="1">
                                    <label for="2.1.1">неудовлетворительно, не устраивает (полностью отсутствуют
                                        электронные и бумажные средства обучения, читальные и методические кабинеты);
                                    </label>
                                    <br>
                                    <input type="radio" id="2.1.2" name="question-2.1" value="2">
                                    <label for="2.1.2">плохо, не соответствует минимальным требованиям (имеются
                                        бумажные средства обучения, читальные и методические кабинеты, отсутствуют
                                        электронные средства обучения);
                                    </label>
                                    <br>
                                    <input type="radio" id="2.1.3" name="question-2.1" value="3">
                                    <label for="2.1.3">удовлетворительно, но со значительными недостатками (имеются
                                        бумажные средства обучения, читальные и методические кабинеты, частично есть
                                        электронные средства обучения);
                                    </label>
                                    <br>
                                    <input type="radio" id="2.1.4" name="question-2.1" value="4">
                                    <label for="2.1.4">в целом хорошо, за исключением незначительных недостатков
                                        (имеются бумажные средства обучения, читальные и методические кабинеты,
                                        электронные средства обучения, за исключением доступа к интернету);
                                    </label>
                                    <br>
                                    <input type="radio" id="2.1.5" name="question-2.1" value="5">
                                    <label for="2.1.5">отлично, полностью удовлетворен(а) (имеются бумажные средства
                                        обучения, читальные и методические кабинеты, электронные средства обучения,
                                        включая доступ к интернету);
                                    </label>
                                </li>
                            </ul>
                        </li>
                    </ol>
                    <hr>
                    <ol class="question">
                        <li>
                            <ul class="point">
                                <li>
                                    <h3>Наличие необходимых условий для охраны и укрепления здоровья обучающихся.</h3>
                                    <input type="radio" id="2.2.1" name="question-2.2" value="1">
                                    <label for="2.2.1">неудовлетворительно, не устраивает (необходимые условия не
                                        созданы
                                        - (отсутствует спортивный зал и спортивные площадки);
                                    </label>
                                    <br>
                                    <input type="radio" id="2.2.2" name="question-2.2" value="2">
                                    <label for="2.2.2">удовлетворительно, но со значительными недостатками (организация
                                        имеет только физкультурный зал);
                                    </label>
                                    <br>
                                    <input type="radio" id="2.2.3" name="question-2.2" value="3">
                                    <label for="2.2.3">в целом хорошо, за исключением незначительных недостатков
                                        (организация оборудована всеми необходимыми спортивными сооружениями (спортзал,
                                        стадион и пр.));
                                    </label>
                                    <br>
                                    <input type="radio" id="2.2.4" name="question-2.2" value="4">
                                    <label for="2.2.4">
                                        отлично, полностью удовлетворен(а) (
                                        организация оборудована всеми необходимыми спортивными
                                        сооружениями, имеются в наличии программы дополнительного образования
                                        физкультурно-спортивной направленности);
                                    </label>
                                </li>
                            </ul>
                        </li>
                    </ol>
                    <hr>
                    <ol class="question">
                        <li>
                            <ul class="point">
                                <li>
                                    <h3>Условия по организации питания обучающихся.</h3>
                                    <input type="radio" id="2.3.1" name="question-2.3" value="1">
                                    <label for="2.3.1">неудовлетворительно, не устраивает (необходимые условия не
                                        созданы
                                        - (отсутствует столовая (буфет));
                                    </label>
                                    <br>
                                    <input type="radio" id="2.3.2" name="question-2.3" value="2">
                                    <label for="2.3.2">отлично, полностью удовлетворен (а) (в организации оборудовано
                                        помещение для питания обучающихся, а также для хранения и приготовления пищи,
                                        обеспечивающие возможность организации качественного горячего питания)
                                    </label>
                                </li>
                            </ul>
                        </li>
                    </ol>
                    <hr>
                    <ol class="question">
                        <li>
                            <ul class="point">
                                <li>
                                    <h3>Условия для индивидуальной работы с обучающимися.</h3>
                                    <input type="radio" id="2.4.1" name="question-2.4" value="1">
                                    <label for="2.4.1">неудовлетворительно, не устраивает (в организации не созданы
                                        условия для индивидуальной работы с обучающимися);
                                    </label>
                                    <br>
                                    <input type="radio" id="2.4.2" name="question-2.4" value="2">
                                    <label for="2.4.2">плохо, не соответствует минимальным требованиям (условия созданы
                                        частично, с использованием электронных средств обучения, без доступа в
                                        интернет);
                                    </label>
                                    <br>
                                    <input type="radio" id="2.4.3" name="question-2.4" value="3">
                                    <label for="2.4.3">удовлетворительно, но со значительными недостатками (в
                                        организации
                                        созданы условия для получения образования в рамках сетевой формы (интернет)
                                        реализации образовательных программ);
                                    </label>
                                    <br>
                                    <input type="radio" id="2.4.4" name="question-2.4" value="4">
                                    <label for="2.4.4">
                                        в целом хорошо, за исключением незначительных недостатков
                                        (в организации созданы условия для получения образования в рамках сетевой формы
                                        (интернет) реализации образовательных программ, а также с применением
                                        дистанционных образовательных программ);
                                    </label>
                                    <br>
                                    <input type="radio" id="2.4.5" name="question-2.4" value="5">
                                    <label for="2.4.5"> отлично, полностью удовлетворен(а) (отлично, полностью
                                        удовлетворен(а)).
                                    </label>
                                </li>
                            </ul>
                        </li>
                    </ol>
                    <hr>
                    <ol class="question">
                        <li>
                            <ul class="point">
                                <li>
                                    <h3>Наличие дополнительных образовательных программ.</h3>
                                    <input type="radio" id="2.5.1" name="question-2.5" value="1">
                                    <label for="2.5.1">неудовлетворительно, не устраивает (дополнительные
                                        образовательные
                                        программы не реализуются);
                                    </label>
                                    <br>
                                    <input type="radio" id="2.5.2" name="question-2.5" value="2">
                                    <label for="2.5.2">плохо, не соответствует минимальным требованиям (реализуется
                                        всего
                                        1 дополнительная образовательная программа);
                                    </label>
                                    <br>
                                    <input type="radio" id="2.5.3" name="question-2.5" value="3">
                                    <label for="2.5.3">
                                        удовлетворительно, но со значительными недостатками (реализуется 2
                                        дополнительных образовательных программа);
                                    </label>
                                    <br>
                                    <input type="radio" id="2.5.4" name="question-2.5" value="4">
                                    <label for="2.5.4">
                                        в целом хорошо, за исключением незначительных недостатков
                                        (реализуются 3 дополнительные образовательные программы);

                                    </label>
                                    <br>
                                    <input type="radio" id="2.5.5" name="question-2.5" value="5">
                                    <label for="2.5.5">
                                        отлично, полностью удовлетворен(а) (реализуются более
                                        3 дополнительных образовательных программ).
                                    </label>
                                </li>
                            </ul>
                        </li>
                    </ol>
                    <hr>
                    <ol class="question">
                        <li>
                            <ul class="point">
                                <li>
                                    <h3>
                                        Наличие возможности развития творческих способностей и интересов обучающихся,
                                        включая их участие в конкурсах и олимпиадах
                                        (в том числе во всероссийских и международных), выставках, смотрах,
                                        физкультурных мероприятиях,
                                        спортивных мероприятиях, в том числе в официальных спортивных соревнованиях, и
                                        других массовых мероприятиях.
                                    </h3>
                                    <input type="radio" id="2.6.1" name="question-2.6" value="1">
                                    <label for="2.6.1">
                                        неудовлетворительно, не устраивает; (условия для развития творческих
                                        способностей не предоставлены);
                                    </label>
                                    <br>
                                    <input type="radio" id="2.6.2" name="question-2.6" value="2">
                                    <label for="2.6.2">плохо, не соответствует минимальным требованиям (предоставлены
                                        условия для участия обучающихся только в спортивных мероприятиях);
                                    </label>
                                    <br>
                                    <input type="radio" id="2.6.3" name="question-2.6" value="3">
                                    <label for="2.6.3">
                                        удовлетворительно, но со значительными недостатками
                                        (предоставлены условия для участия обучающихся в спортивных мероприятиях и
                                        частично в образовательных (олимпиады, выставки, смотры));
                                    </label>
                                    <br>
                                    <input type="radio" id="2.6.4" name="question-2.6" value="4">
                                    <label for="2.6.4">
                                        в целом хорошо, за исключением незначительных недостатков
                                        (предоставлены условия для участия обучающихся в спортивных мероприятиях и в
                                        образовательных (олимпиады, выставки, смотры), но только на региональном
                                        уровне);
                                    </label>
                                    <br>
                                    <input type="radio" id="2.6.5" name="question-2.6" value="5">
                                    <label for="2.6.5">
                                        отлично, полностью удовлетворен(а) (предоставлены все условия
                                        для участия обучающихся в международных и всероссийских олимпиадах и спортивных
                                        мероприятиях).
                                    </label>
                                </li>
                            </ul>
                        </li>
                    </ol>
                    <hr>
                    <ol class="question">
                        <li>
                            <ul class="point">
                                <li>
                                    <h3>
                                        Наличие возможности оказания психолого-педагогической, медицинской и социальной
                                        помощи обучающимся.
                                    </h3>
                                    <input type="radio" id="2.7.1" name="question-2.7" value="1">
                                    <label for="2.7.1">
                                        неудовлетворительно, не устраивает (Отсутствуют условия
                                        для оказания вышеуказанных видов помощи);
                                    </label>
                                    <br>
                                    <input type="radio" id="2.7.2" name="question-2.7" value="2">
                                    <label for="2.7.2">
                                        плохо, не соответствует минимальным требованиям (вышеуказанные
                                        виды помощи оказываются некачественно);
                                    </label>
                                    <br>
                                    <input type="radio" id="2.7.3" name="question-2.7" value="3">
                                    <label for="2.7.3">
                                        удовлетворительно, но со значительными недостатками (имеется
                                        возможность качественно оказывать один из видов помощи
                                        (психолого-педагогической, медицинской или социальной));
                                    </label>
                                    <br>
                                    <input type="radio" id="2.7.4" name="question-2.7" value="4">
                                    <label for="2.7.4">
                                        в целом хорошо, за исключением незначительных недостатков (имеется
                                        возможность качественно оказывать как минимум 2 вида помощи
                                        (психолого-педагогической, медицинской или социальной));
                                    </label>
                                    <br>
                                    <input type="radio" id="2.7.5" name="question-2.7" value="5">
                                    <label for="2.7.5">
                                        отлично, полностью удовлетворен(а) (имеется возможность
                                        качественно оказывать все 3 вида помощи (психолого-педагогической, медицинской
                                        или социальной)).
                                    </label>
                                </li>
                            </ul>
                        </li>
                    </ol>
                    <hr>
                    <ol class="question">
                        <li>
                            <ul class="point">
                                <li>
                                    <h3>
                                        Наличие условий организации обучения и воспитания обучающихся с ограниченными
                                        возможностями здоровья и инвалидов. </h3>
                                    <input type="radio" id="2.8.1" name="question-2.8" value="1">
                                    <label for="2.8.1">
                                        неудовлетворительно, не устраивает (условия полностью отсутствуют);;
                                    </label>
                                    <br>
                                    <input type="radio" id="2.8.2" name="question-2.8" value="2">
                                    <label for="2.8.2">
                                        плохо, не соответствует минимальным требованиям (имеющиеся
                                        условия частично удовлетворяют потребностям обучающихся, в частности,
                                        предоставлено недостаточное количество мест для обучающихся, неудобное время
                                        проведения занятий (вечернее, ночное), организованные рабочие места -
                                        некомфортны);
                                    </label>
                                    <br>
                                    <input type="radio" id="2.8.3" name="question-2.8" value="3">
                                    <label for="2.8.3">
                                        удовлетворительно, но со значительными недостатками
                                        (организованных рабочих мест для обучения и их оснащение удовлетворительны,
                                        неудобно время проведения занятий и отсутствуют сопутствующие услуги);
                                    </label>
                                    <br>
                                    <input type="radio" id="2.8.4" name="question-2.8" value="4">
                                    <label for="2.8.4">
                                        в целом хорошо, за исключением незначительных недостатков условия
                                        соответствуют потребностям, отсутствуют сопутствующие услуги (специально
                                        оснащенный туалет, специальные места подхода/подъезда);
                                    </label>
                                    <br>
                                    <input type="radio" id="2.8.5" name="question-2.8" value="5">
                                    <label for="2.8.5">
                                        отлично, полностью удовлетворен(а) (условия полностью
                                        соответствуют потребностям).
                                    </label>
                                </li>
                            </ul>
                        </li>
                    </ol>
                    <hr>
                </li>

                <li class="section" id="section-3">
                    <h2>Доброжелательность, вежливость, компетентность работников.</h2>
                    <ol class="question">
                        <li>
                            <ul class="point">
                                <li>
                                    <h3>Доброжелательность и вежливость работников.</h3>
                                    <input type="radio" id="3.1.1" name="question-3.1" value="1">
                                    <label for="3.1.1">неудовлетворительно, не устраивает;</label>
                                    <br>
                                    <input type="radio" id="3.1.2" name="question-3.1" value="2">
                                    <label for="3.1.2">удовлетворительно;</label>
                                    <br>
                                    <input type="radio" id="3.1.3" name="question-3.1" value="3">
                                    <label for="3.1.3">
                                        в целом хорошо, но есть недостатки;
                                    </label>
                                    <br>
                                    <input type="radio" id="3.1.4" name="question-3.1" value="4">
                                    <label for="3.1.4">
                                        полностью устраивает.
                                    </label>
                                </li>
                            </ul>
                        </li>
                    </ol>
                    <hr>
                    <ol class="question">
                        <li>
                            <ul class="point">
                                <li>
                                    <h3>
                                        Компетентность работников.
                                    </h3>
                                    <input type="radio" id="3.2.1" name="question-3.2" value="1">
                                    <label for="3.2.1">
                                        неудовлетворительно, не устраивает;
                                    </label>
                                    <br>
                                    <input type="radio" id="3.2.2" name="question-3.2" value="2">
                                    <label for="3.2.2">удовлетворительно;</label>
                                    <br>
                                    <input type="radio" id="3.2.3" name="question-3.2" value="3">
                                    <label for="3.2.3">в целом хорошо, но есть недостатки;
                                    </label>
                                    <br>
                                    <input type="radio" id="3.2.4" name="question-3.2" value="4">
                                    <label for="3.2.4">полностью устраивает.
                                    </label>
                                </li>
                            </ul>
                        </li>
                    </ol>
                    <hr>
                </li>

                <li class="section" id="section-4">
                    <h2>Общее удовлетворение качеством образовательной деятельности организации.</h2>
                    <ol class="question">
                        <li>
                            <ul class="point">
                                <li>
                                    <h3>Удовлетворение материально-техническим обеспечением организации.</h3>
                                    <input type="radio" id="4.1.1" name="question-4.1" value="1">
                                    <label for="4.1.1">неудовлетворительно, не устраивает;</label>
                                    <br>
                                    <input type="radio" id="4.1.2" name="question-4.1" value="2">
                                    <label for="4.1.2">удовлетворительно;</label>
                                    <br>
                                    <input type="radio" id="4.1.3" name="question-4.1" value="3">
                                    <label for="4.1.3">
                                        в целом хорошо, но есть недостатки;
                                    </label>
                                    <br>
                                    <input type="radio" id="4.1.4" name="question-4.1" value="4">
                                    <label for="4.1.4">
                                        полностью устраивает.
                                    </label>
                                </li>
                            </ul>
                        </li>
                    </ol>
                    <hr>
                    <ol class="question">
                        <li>
                            <ul class="point">
                                <li>
                                    <h3>
                                        Удовлетворение качеством предоставляемых образовательных услуг.
                                    </h3>
                                    <input type="radio" id="4.2.1" name="question-4.2" value="1">
                                    <label for="4.2.1">
                                        неудовлетворительно, не устраивает;
                                    </label>
                                    <br>
                                    <input type="radio" id="4.2.2" name="question-4.2" value="2">
                                    <label for="4.2.2">удовлетворительно;</label>
                                    <br>
                                    <input type="radio" id="4.2.3" name="question-4.2" value="3">
                                    <label for="4.2.3">в целом хорошо, но есть недостатки;
                                    </label>
                                    <br>
                                    <input type="radio" id="4.2.4" name="question-4.2" value="4">
                                    <label for="4.2.4">полностью устраивает.
                                    </label>
                                </li>
                            </ul>
                        </li>
                    </ol>
                    <hr>
                    <ol class="question">
                        <li>
                            <ul class="point">
                                <li>
                                    <h3>
                                        Готовность рекомендовать организацию родственникам и знакомым.
                                    </h3>
                                    <input type="radio" id="4.3.1" name="question-4.3" value="1">
                                    <label for="4.3.1">не готов порекомендовать;
                                    </label>
                                    <br>
                                    <input type="radio" id="4.3.2" name="question-4.3" value="2">
                                    <label for="4.3.2">возможно рекомендую;
                                    </label>
                                    <br>
                                    <input type="radio" id="4.3.3" name="question-4.3" value="3">
                                    <label for="4.3.3">готов рекомендовать;
                                    </label>
                                </li>
                            </ul>
                        </li>
                    </ol>
                    <hr>
                </li>

            </ol>
            <button>
                Отправить ответы
            </button>
        </form>
    </div>
</body>